#include <iostream>

/*
	Напишіть програму, яка відповідає за інформацію про учнів в класі. Є наступна структура:

	struct Student
	{
    	char name[50] = {};    // ім'я учня
     	char surname[50] = {}; // фамілія
	    int age = 0;           // вік учня
	    double rating = 0.0;   // середня оцінка по всім предметам
	};

	Напишіть наступні функції:

	void ShowStudentInfo(const Student& student)
	- красиво виводить інформацію про одного учня

	void ShowStudentsInfo(const Student& students, int size)
	- красиво виводить інформацію про всіх учнів (використовує функцію ShowStudentInfo)

	void ChangeStudentFullName(Student& student)
	- дає користувачу переписати ім'я і фамілію учня

	void ChangeStudentAge(Student& student)
	- дає користувачу переписати вік учня

	void ChangeStudentRating(Student& student)
	- дає користувачу переписати середню оцінку учня

	У вас з самого початку на кучі має бути масив з 3 учнів. Заповніть їх вручну в коді. Далі у вас є меню з наступними пунктами:

	- Показати інформацію про всіх учнів класу
	- Показати інформацію про конкретного учня (ви указуєте його ім'я і фамілію)
	- Змінити інформацію про учня (ви указуєте його ім'я і фамілію)
  Якщо такий учень існує, то появляється інше меню:
  - Змінити повне ім'я і фамілію учня
  - Змінити вік учня
  - Змінити середню оцінку учня
  - Повернутися в головне меню
	- Додати нового учня (користувач повністю заповнює інформацію про учня. Якщо учень з таким ім'ям і фамілією уже існує - програма про це каже і не додає нового учня до списку існуючих)
	- Видалити учня (користувач вводить ім'я і фамілію учня. Якщо його не існує - програма про це каже. Якщо існує - видаляє його зі списку.
	- Дізнатися середню оцінку класу (сума середніх оцінок всіх учнів, розділена на їх кількість)
	- Дізнатися, хто з учнів найкраще вчиться (визначається по найвищій середній оцінці учня, показує ім'я і фамілію цього учня)
	- Дізнатися, хто з учнів найгірше вчиться (ну тут уже самі догадайтеся, що треба робити)
	- Відсортувати учнів по алфавітному порядку
	- Вийти з програми

	Як мають виглядати всі інші функції - думайте самі. Пишіть любу кількість функцій, викликайте одну функцію з іншої, не пишіть функції взагалі - робіть що хочете. Головне, аби програма працювала вірно.
*/

int main()
{

	return 0;
}
