#include <iostream>

/*
    Переробіть першу задачу з попереднього практичного уроку в шаблон функції. Там ви писали перезавантажену функцію ShowType. Вам буде тяжко переробити її в шаблон функції, бо кожне перезавантаження виводило різний текст. Але в C++ є конструкція, яка повертає тип значення в текстовому вигляді. Я про нього розповідатиму в уроці "typeid". Зараз же знайте, що конструкція "typeid(ваші_дані).name()" повертає на своє місце рядок, який містить тип значення. Тобто ось цей код:
    std::cout << typeid(10).name();
    виведе на екран слово "int". Ось тепер ви зможете вирішити цю задачу.
*/
template <typename  T>
void show_type(T data);

int main()
{
	show_type(13.4);
	show_type('W');
	show_type(true);
	show_type(false);
	return 0;
}

template <typename T>
void show_type(T data)
{
	std::cout << "Type: " << typeid(data).name() << '\n';
}
