#include <iostream>

/*
Створіть масив типу int з іменем numbers розміром 5. Завдяки списковій ініціалізації 
заповніть його елементи наступними значеннями: 5, 10, 15, 20, 25.
Завдяки циклу for виведіть на екран всі елементи цього масиву у рядок з проміжком в пробіл.
Тобто вивід має бути ось такий: 5 10 15 20 25
*/

int main() {
	constexpr int NUMBERS_SIZE	= 5;
	int numbers[NUMBERS_SIZE]	= {5, 10, 15, 20, 25};

	for (int i = 0; i < NUMBERS_SIZE; i++) {
		std::cout << numbers[i] << " ";
	}

	return 0;
}