#include <iostream>

/*
	Ще одна математична задача, тільки простіша. У вас є схожа структура:
	struct Point
	{
    	int x;
     	int y;
	};

	Напишіть наступну функцію:

	int GetCoordinateSystemPart(const Point& point)
	  - перевіряє, в якій чверті координатної сітки знаходиться точка. Повертає:
	  - 1, якщо в першій    (коли x > 0 i y > 0)
	  - 2, якщо в другій    (коли x < 0 i y > 0)
	  - 3, якщо в третій    (коли x < 0 i y < 0)
	  - 4, якщо в четвертій (коли x > 0 i y < 0)
	  - 0, якщо точка лежить на осях

	Створіть масив із 10 точок. Задавайте їм випадкові значення від -5 до 5. Для кожної точки викличіть цю функцію, щоб дізнатися, де вона лежить.
*/

int main()
{

	return 0;
}
