#include <iostream>
#include <windows.h>

/*
Запитайте в користувача, чи йому є 16 років. Наприклад "Введіть 1, якщо так, або 0, якщо ні".
Також запитайте, чи він живе в Україні. Ввід аналогічний. Якщо йому уже є 16 і він живе в Україні,
то напишіть повідомлення "Ви можете отримати паспорт громадянина України". Інакше "Ви не можете ...".
*/

int main() {
	SetConsoleOutputCP(CP_UTF8);

	bool is_adult		= false;
	bool is_in_ukraine	= false;

	std::cout << "Чи є тобі 16 років? (1 - так, 0 - ні): ";
	std::cin >> is_adult;
	std::cout << "Чи проживаєш ти в Україні? (1 - так, 0 - ні): ";
	std::cin >> is_in_ukraine;

	std::cout << "Ви " << (is_adult && is_in_ukraine ? "можете" : "не можете") 
			<< " отримати паспорт громадянина України" << std::endl;

	return 0;
}