#include <iostream>

/*
Давайте спробуємо модернізувати попередню задачу так, щоб у нас була крута функція, яка повертає рядок, який ввів користувач. У неї всередині має бути статичний символьний масив розміром 256 і кожний раз, коли ви її викликаєте, користувач вводить спочатку текст саме в нього, після чого виділяється пам'ять на кучі для динамічного рядка і в нього записуються всі ці символи. А в кінці функція повертає адресу цього рядка.

Тобто у вас є прототип:
`char* EnterString();`

Всередині відбувається наступне:
	char* EnterString()
	{
		static int BUFFER_SIZE = 256;
		static char buffer[BUFFER_SIZE];

		// 1. Користувач вводить текст в buffer.
		// 2. Визначається довжина buffer.
		// 3. Виділяється на кучі рядок з необхідною довжиною + нуль-символом.
		// 4. Символи з buffer копіюються в цей динамічний рядок.
		// 5. Функція повертає цей рядок.
	}

І тепер ви можете з легкістю писати наступне:
	std::cout << "Enter your name: ";
	const char* name = EnterString(); // Якщо я введу Demian, то name = "Demian" і має довжину 6

	std::cout << "Enter your surname: ";
	const char* surname = EnterString(); // Якщо я введу Bloganovich, то surname = "Bloganovich" і
	// має довжину 11

*/

int main()
{

	return 0;
}