#include <iostream>

/*
	Попрацюємо з датами. Є наступна структура:

	struct Date
	{
    	int day;
     	int month;
      	int year;
	};

	Напишіть наступні функції:

	bool IsLeapYear(const Date& date)
	- повертає true, якщо рік високосний.

	Date GetDateDifference(const Date& date1, const Date& date2)
	- повертає різницю двох дат (скільки днів, місяців і років між ними).

	const char* GetMonthName(const Date& date)
	- повертає назву місяця за його числом у даті. Тобто якщо число 2, значить повертає "February".

	bool IsCorrectDate(const Date& date)
	- В поля структури дати можна записати некоректні значення (від'ємні значення в любе поле, 0 в любе поле окрім року. Також при певному місяці не може бути кількість днів більша за певну. Наприклад в лютому кількість днів має бути обов'язково менша за 29, а якщо рік високосний, то менша за 30).

	int GetDaysInDate(const Date& date)
	- повертає дату в днях (дні + місяці в днях + роки). Врахуйте можливість того, що рік може бути високосним.

	int GetDaysInMonth(int monthIndex, bool isLeapYear)
	- повертає кількість днів в указаному місяці (по його індексу, який починається з 1). Функція враховує високосність року завдяки другому параметру.

	Створіть наступну структуру:
	struct Holiday
	{
    Date date;       // дата свята
    char name[100];  // назва свята
	};

	Створіть масив із 5 елементів типу Holiday, заповніть їх списковою ініціалізацією. Свята вибирайте, які хочете. Напишіть наступну функцію:

	bool IsHoliday(const Date& date, const Holiday holidays[], int holidaysCount)
	- повертає true, якщо указана дата є святом.

	Перевірте всі написані вами функції.
*/

int main()
{

	return 0;
}
