#include <iostream>
#include <windows.h>

/*
Спитайте в користувача, чи є йому 16 років. 
Наприклад "Введіть 1, якщо так, або 0, якщо ні".
Також запитайте, чи він живе в Україні. Ввід аналогічний. 
	- Якщо йому вже є 16 років і він проживає в Україні - повідомлення "Ви можете отримати паспорт громадянина України".
	- Інакше - повідомлення "Ви не можете отримати паспорт громадянина України".
*/

int main() {
	// enable unicode in console
	SetConsoleOutputCP(CP_UTF8);

	bool is_adult;
	bool is_in_ukraine;

	std::cout << "Чи є Вам 16 років? (1 - так, 0 - ні): ";
	std::cin >> is_adult;

	std::cout << "Чи проживаєте Ви в Україні? (1 - так, 0 - ні): ";
	std::cin >> is_in_ukraine;

	if (is_adult && is_in_ukraine) {
		std::cout << "Ви можете отримати паспорт громадянина України" << std::endl;
	}
	else {
		std::cout << "Ви не можете отримати паспорт громадянина України" << std::endl;
	}

	return 0;
}