#include <iostream>
#include <windows.h>

/*
Треба вас навчити реалізувати меню. Що таке меню? Це набір пунктів, і користувач має обрати один з них.
Тому виведіть на екран наступне меню:
	
	1 - Розпочати гру
	2 - Завантажити гру
	3 - Налаштування
	4 - Автори
	5 - Вихід

Після цього дайте користувачу ввести число і проаналізуйте його.
Якщо це 1 - виведіть повідомлення "Гра розпочата".
Якщо це 2 - виведіть повідомлення "Гра завантажується".
і так далі.

Також врахуйте, що користувач може ввести не те число. В такому випадку виведіть повідомлення "Некоректний ввід".
*/

int main() {
	SetConsoleOutputCP(CP_UTF8);
	std::cout << 
R"( _____ _   _ _____    ____    _    __  __ _____ 
|_   _| | | | ____|  / ___|  / \  |  \/  | ____|
  | | | |_| |  _|   | |  _  / _ \ | |\/| |  _|  
  | | |  _  | |___  | |_| |/ ___ \| |  | | |___ 
  |_| |_| |_|_____|  \____/_/   \_\_|  |_|_____|
)";
	std::cout << 
R"(	1 - Розпочати гру
	2 - Завантажити гру
	3 - Налаштування
	4 - Автори
	5 - Вихід	
)" << std::endl;
	int menu_item;

	std::cout << "Choise: ";
	std::cin >> menu_item;

	switch (menu_item) {
		case 1:
			std::cout << "Гра розпочата!" << std::endl;
			break;
		case 2:
			std::cout << "Гра завантажується!" << std::endl;
			break;
		case 3:
			std::cout << "Гра налаштовується!" << std::endl;
			break;
		case 4:
			std::cout << "Автори демонструються!" << std::endl;
			break;
		case 5:
			std::cout << "Гра закривається!" << std::endl;
			break;
		default:
			std::cout << "Некоректний ввід" << std::endl;
	}

	return 0;
}