#include <iostream>

/*
Щоб не повторювати умову з попередньої задачі, буду тепер пойстійно казати "Користувач вводить речення". Це означає, що у вас має бути масив з достатньої кількості символів (наприклад 100) і ви маєте вводити це речення завдяки cin.getline. Так от...

Користувач вводить речення, після цього вводить два символи. Перший - той, який він хоче замінити в рядку. Другий - той, на який треба замінити. Наприклад, якщо користувач введе речення "Hello World", а потім символи 'l' та 'M', ваш рядок має стати ось таким:
	"HeMMo WorMd"
*/

int main() {

	return 0;
}
