#include <iostream>

/*
	Це складна задача, бо в ній вам треба скористатися речами, про які я не розповідав. Перед вами є код:

    int main()
    {
        int arr1[2] = {};
        int arr2[3] = {};
        int arr3[4] = {};
        int* arr4 = new int[5] {};

        Show(arr1);
        Show(arr2);
        Show(arr3);
        Show(arr4, 5);

        return 0;
    }

    Ваша задача написати функцію Show. Вона виводить елементи масиву на екран. В чому взагалі діло? Діло в тому, що в коді є як масиви на стеку, так і масиви на кучі. Ми знаємо, як написати функцію, яка може приймати їх обох, наприклад ось так:

    void Show(int arr[], int size) - в даному випадку ми передаємо адресу масивів з їх розмірами в неї.

    Але масиви на стеку мають мати розмір, який компілятор може порахувати на етапі компіляції. Ми можемо цим скористатися. Гляньте на код вище, там функція Show приймає ЛИШЕ масиви зі стеку, без їх розміру. Масиви з кучі треба передавати разом з їх розмірами, бо через вказівник компілятор не може дізнатися розмір масиву. Вам треба написати дві функції Show: перша приймає масиви в зрозумілому нам вигляді, я її прототип написав вище. А друга має створювати ПОСИЛАННЯ на масиви. Коли ви створюєте посилання на масив, ви маєте указувати його розмір. В параметрах функції це можна зробити ось так:

    void Show(int (&arr)[2])
    {
        for (int i = 0; i < 2; i++) { ... }
    }

    Але проблема цієї функції в тому, що вона не працюватиме з іншими масивами, розмір яких не 2. І ось тут вам треба використати шаблони. Коли ви пишете ось такий код:

    template <typename T>

    То T - це шаблонний параметр типу, він може змінюватися залежно від типу значення, яке ви відправляєте. І от у нас є різні розміри масивів: 2,3,4. Проблема в тому, що вони мають одинаковий тип - int. Але ви можете написати шаблон функції, використовуючи явний параметр типу, а не шаблонний, наприклад ось так:

    template <int a>
    void Func(double value)
    {
        std::cout << value + a;
    }

    І викликати цю функцію можна ось так:

    double value = 10.0;
    Func<2>(value); // виведе 12
    Func<5>(value); // виведе 15

    Скористайтеся цими знаннями, щоб написати шаблон функції Show, як створює посилання на масив, розмір якого і є цим явним параметром.
*/

void show(const int* arr, const int size);

template <int n>
void show(const int (& arr)[n]);

int main()
{
    int arr1[2] = {1, 2};
    int arr2[3] = {1, 2, 3};
    int arr3[4] = {1, 2, 3, 4};
    int* arr4 = new int[5] {1, 2, 3, 4, 5};

    show(arr1);
    show(arr2);
    show(arr3);
    show(arr4, 5);

    delete[] arr4;

	return 0;
}

void show(const int* arr, const int size)
{
    std::cout << "array (" << size << ") [";
    for (int i = 0; i < size; i++)
    {
        std::cout << arr[i];

        if (i < size - 1)
        {
            std::cout << ", ";
        }
    }
    std::cout << "]\n";
}

template <int n>
void show(const int (&arr)[n])
{
    std::cout << "array (" << n << ") [";
    for (int i = 0; i < n; i++)
    {
        std::cout << arr[i];

        if (i < n - 1)
        {
            std::cout << ", ";
        }
    }
    std::cout << "]\n";
}
