#include <iostream>

/*
Є початковий символьний масив із 256 елементів. Попросіть в користувача ввести в нього текст. Після цього знайдіть довжину цього тексту і створіть динамічний масив, куди скопіюйте всі елементи з вашого масиву (до нуль-символу). 

Скористайтеся наступними функціями:
	`void EnterText(char* buffer)` - дає користувачу ввести текст в указаний масив
	`int Length(const char* str)` - повертає довжину рядка (кількість символів до нуль-символа)
	`char* CreateString(int size)` - створює пустий рядок за указаним розміром (розмір: це довжина + нуль-символ)
	`void Copy(char* destination, const char* source)` - копіює другий рядок в перший

Виведіть на екран обидва масиви, вони мають показувати однаковий текст.
*/

int main()
{

	return 0;
}