#include <iostream>

/*
	Замініть структуру Student із попередньої задачі на наступну:
	struct Student
	{
    	String name;         // ім'я учня
	    String surname;      // фамілія
	    Date birthday;       // дата народження учня
	    double rating = 0.0; // середня оцінка по всім предметам
	};

	Вам треба переписати програму, використовуючи ваші структури із задач 3 і 4. Інформація про учня тепер має не лише виводити вік (його прийдеться рахувати згідно дати народження), але й саму дату народження учня. Також при додаванні нового учня користувач має вводити не вік учня, а його дату народження. Не забувайте про всі виділення пам'яті на кучі - їх треба буде видалити.
*/

int main()
{

	return 0;
}
