#include <iostream>

/*
Є змінна int a = 10. Створіть на неї void-вказівник. Ваша задача наступна: маючи з самого початку лише void-вказівник на змінну, змінити її значення на 5. Ви можете створити новий вказівник і привести void-вказівник до нього, після чого розіменувати int-вказівник і змінити значення змінної. В кінці виведіть її значення на екран, щоб перевірити, чи воно дійсно змінилось
*/

int main()
{
	int a = 10;

	void* p_a = &a;
	*((int*)p_a) = 5;

	std::cout << a << std::endl;
	return 0;
}
