#include <iostream>

/*
Вертаємося до температур. Створіть 5 змінних - це температури першого дня, другого і так далі.
Всі 5 днів температура була одна й та сама = 10 градусів. 
Зробіть 3 речі:
	- В одному рядку створіть 5 змінних і ініціалізуйте їх цим значенням;
	- Створіть 5 змінних в одному рядку, але ініціалізуйте кожну ОКРЕМО в наступних рядках;
	- Створіть 5 змінних в одному рядку, але ініціалізуйте їх в наступному рядку РАЗОМ (завдяки оператору =).
Знайдіть для себе найгарніший варіант.
*/

int main() {
	// stage 1
	int temp1 = 10, temp2 = 10, temp3 = 10, temp4 = 10, temp5 = 10;

	// stage 2
	int temp11, temp22, temp33, temp44, temp55;
	temp11 = 10;
	temp22 = 10;
	temp33 = 10;
	temp44 = 10;
	temp55 = 10;

	// stage 3
	int temp111, temp222, temp333, temp444, temp555;
	temp111 = temp222 = temp333 = temp444 = temp555 = 10;

	return 0;
}