#include <iostream>
#include <windows.h>

/*
Насправді ви вже можете написати просту вікторину. Спробуємо?
Гра задає користувачу 3 питання. Якщо він відповідає правильно на перше - виводиться друге питання.
Якщо він відповідає правильно на друге - виводиться третє.
Якщо він відповідає правильно на третє - виводиться повідомлення "Ви знаєте все! Молодець!".

Які питання? Ну наприклад ось такі:
	1. Скільки буде 2 + 2?
	   Відповіді: a) 4
	              b) 8
	              c) 2
	              d) 5
	2. Скільки планет в сонячній системі?
	   Відповіді: a) 7
	              b) 8
	              c) 9
	              d) 10
	1. Яка порода собак схожа на сосиску?
	   Відповіді: a) Бульдог
	              b) Мопс
	              c) Такса
	              d) Лабрадор

У всіх питаннях є лише одна правильна відповідь. Тобто по факту у вас є 3 меню. У всіх питаннях
користувач вводить символ. Ви перевіряєте його в switch і в правильній case-мітці задаєте друге питання.

У всіх default-мітках ви виводите повідомлення "Ви ввели некоректну букву".
У всіх неправильних case-мітках ви виводите повідомлення "Неправильна відповідь. Ви програли".

У вас має бути програма, де буде switch, в одній case-мітці якого буде другий switch,
в одній case-мітці якого буде третій switch. Так, код буде трохи не гарний і заплутаний,
але це чудова задача на практику. В майбутньому можливо вернетеся до цього коду і напишете кращий варіант.
*/

int main() {
	SetConsoleOutputCP(CP_UTF8);

	std::cout <<
R"(__     __ ___  ____  _____  ___   ____   ___  _   _     _    
\ \   / /|_ _|/ ___||_   _|/ _ \ |  _ \ |_ _|| \ | |   / \   
 \ \ / /  | || |      | | | | | || |_) | | | |  \| |  / _ \  
  \ V /   | || |___   | | | |_| ||  _ <  | | | |\  | / ___ \ 
   \_/   |___|\____|  |_|  \___/ |_| \_\|___||_| \_|/_/   \_\
)";
	
	char user_answer;
	std::cout << "1. Скільки буде 2 + 2?" << std::endl;
	std::cout << "Відповіді: a) 4" << std::endl;
	std::cout << "           b) 8" << std::endl;
	std::cout << "           c) 2" << std::endl;
	std::cout << "           d) 5" << std::endl;
	std::cout << "answer: ";
	std::cin >> user_answer;
	switch (user_answer) {
		case 'A' :
		case 'a' : {
			std::cout << "2. Скільки планет в сонячній системі?" << std::endl;
			std::cout << "Відповіді: a) 7" << std::endl;
			std::cout << "           b) 8" << std::endl;
			std::cout << "           c) 9" << std::endl;
			std::cout << "           d) 10" << std::endl;
			std::cout << "answer: ";
			std::cin >> user_answer;

			switch (user_answer) {
				case 'A' :
				case 'a' : {
					std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
					break;
				}
				case 'B' :
				case 'b' : {
					std::cout << "3. Яка порода собак схожа на сосиску?" << std::endl;
					std::cout << "Відповіді: a) Бульдог" << std::endl;
					std::cout << "           b) Мопс" << std::endl;
					std::cout << "           c) Такса" << std::endl;
					std::cout << "           d) Лабрадор" << std::endl;
					std::cout << "answer: ";
					std::cin >> user_answer;
					
					switch (user_answer) {
						case 'A' :
						case 'a' : {
							std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
							break;
						}
						case 'B' :
						case 'b' : {
							std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
							break;
						}
						case 'C' :
						case 'c' : {
							std::cout << "Ви знаєте все! Молодець!" << std::endl;
							break;
						}
						case 'D' :
						case 'd' : {
							std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
							break;
						}
						default: {
							std::cout << "Ви ввели некоректну букву" << std::endl;
						}
					}
					break;
				}
				case 'C' :
				case 'c' : {
					std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
					break;
				}
				case 'D' :
				case 'd' : {
					std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
					break;
				}
				default: {
					std::cout << "Ви ввели некоректну букву" << std::endl;
				}
			}
			break;
		}
		case 'B' :
		case 'b' : {
			std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
			break;
		}
		case 'C' :
		case 'c' : {
			std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
			break;
		}
		case 'D' :
		case 'd' : {
			std::cout << "Неправильна відповідь. Ви програли!" << std::endl;
			break;
		}
		default: {
			std::cout << "Ви ввели некоректну букву" << std::endl;
		}
	}

	return 0;
}