#include <iostream>

/*
Створіть змінну, яка рівна 1.
Завдяки циклу збільшуйте її на 1 кожну ітерацію.
Задача - вивести числа від 1 до 100 (включно).
*/

int main() {
	int i = 1;

	while (i <= 100) {
		std::cout << i << std::endl;
		i++;
	}

	return 0;
}