#include <iostream>

/*
Оператори
    << - побітовий зсув вліво
    >> - побітовий зсув вправо
    ~  - інверсія бітів
    &  - побітове AND
    |  - побітове OR
    ^  - побітове XOR
 */

/*
 	Важливо: при роботі з побітовими операторами треба використовувати unsigned типи даних, бо c++ не гарантує правильність виконання операцій при роботі з unsigned типами.
 */
int main()
{
	unsigned char a = 0b0000'1100;
	unsigned char b = 0b0000'0101;
	unsigned char c = a ^ b;
	std::cout << (int) c << std::endl;
	return 0;
}
