#include <iostream>

/*
Напишіть програму, в якій є 2 масиви-рядки. В першому записане слово "Hello", а в другому "World". Ця програма має створити 3 масив, розмір якого буде достатній, щоб вмістити в собі об'єднання цих двох рядків. Тобто в третьому масиві має бути значення "Hello World" але ви маєте задати йому таке значення наступним чином:
    - Спочатку скопіювавши вміст першого рядка.
    - Потім дописати пробіл.
    - Потім дописати вміст другого рядка.

Виведіть результуючий рядок на екран.
*/

int main() {

	return 0;
}
