#include <iostream>
#include <Windows.h>

/*
Аналогічна задача, тільки тепер речення на українській мові і замість std::endl використовуйте послідовність \n.
*/

int main() {
	SetConsoleOutputCP(CP_UTF8);
	SetConsoleCP(CP_UTF8);

	std::cout << "Джуринський водоспад – одне з неповторно красивих місць України.\n";
	std::cout << "Це найбільший рівнинний водоспад Європи, який має шістнадцять метрів заввишки.\n";
	std::cout << "Тече він біля села Нирків на Тернопільщині.\n";
	std::cout << "До речі, ця пам’ятка виникла завдяки втручанню людини.\n";
	std::cout << "Як свідчать перекази, колись неподалік теперішнього водоспаду стояв неприступний Червоногрудський замок графині Любомирської.\n";
	std::cout << "У цьому місці річка Джурин, що текла по своєрідному каньйону, робила закрут, омиваючи півострів, на якому височів палац.\n";
	std::cout << "Місцина ця була невимовно красивою: могутні дерева та чисті води, спів птахів і горді лісові мешканці – усе це було схоже на справжній райський куточок.\n";
	std::cout << "Саме тому, мабуть, багато хто хотів загарбати цю територію.\n";
	std::cout << "Після невдалої тривалої облоги турки вирішили повернути русло річки, відкриваючи собі підступ до не скореного ними замку.\n";
	std::cout << "Ось так утворився Джуринський водоспад.\n";
	std::cout << "Підтвердження цієї легенди – безводний, порослий де-не-де віковічними деревами глибокий рів навколо руїн фортеці.\n";

	return 0;
	return 0;
}